In [ ]:
======================= EDA =============================
1) pandas : Data frame applications
    
    
2) Numpy: Numerical python all math applications
    
3) Matplotlib : used for plotting
    
4) seaborn    : used for plot
    
5) plotly     : used for flot
    
6) Bokhe      : plot
    
=========================== Machine learning ==============================
7) sickit-learn: skleran
    
=========================== Deep learning =================================
8) Tensorflow  : Google
 
9) Keras       : Google
    
10) pytorch    : Facebook
     
========================== NLP =============================================
11) NLTK   : Natural langague tool kit
    
12) scipy  

============================= BERT ========================================
13) Transoformers  : Hugging face (Google)
    
============================= Google models ===============================
14) Specific google packages

============================== Azure ML ==================================
15) Azure packages

============================== GenAI ========================================
16) Gemini  : Google
    
17) ChatGPT  : openAI
    
============================== LangChain ====================================
18) LangChain packages

**Create a dataframe using list**

- list ==== dictionary
    
- dictionary ====== list

$step-1$

**create a dataframe**

In [1]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame() # empty dataframe no rows and no colums

Empty DataFrame
Columns: []
Index: []

$Step -2$

**Provide the data**

In [2]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [3]:
names=['Ayush','Avinash','Akash']
Age=[20,30,40]
pd.DataFrame(names,Age)

          0
20    Ayush
30  Avinash
40    Akash

In [4]:
names=['Ayush','Avinash','Akash']
Age=[20,30,40]
pd.DataFrame(zip(names,Age))

# what is the first positional argument : data
# second positional argument : index

         0   1
0    Ayush  20
1  Avinash  30
2    Akash  40

In [13]:
names=['Ayush','Avinash','Akash']
Age=[20,30,40]
city=['hyd','blr','chenai']
pd.DataFrame(zip(names,Age,city))

         0   1       2
0    Ayush  20     hyd
1  Avinash  30     blr
2    Akash  40  chenai

In [6]:
names=['Ayush','Avinash','Akash']
Age=[20,30,40]
city=['hyd','blr','chenai']
data=zip(names,Age)
pd.DataFrame(data,city)

              0   1
hyd       Ayush  20
blr     Avinash  30
chenai    Akash  40

$Step-3$

**provide the column names**

In [7]:
names=['Ayush','Avinash','Akash']
Age=[20,30,40]
pd.DataFrame(zip(names,Age),
             columns=['Names','Age'])

     Names  Age
0    Ayush   20
1  Avinash   30
2    Akash   40

In [8]:
names=['Ayush','Avinash','Akash']
Age=[20,30,40]
pd.DataFrame(zip(names,Age),['Names','Age','c'])

             0   1
Names    Ayush  20
Age    Avinash  30
c        Akash  40

In [9]:
names=['Ayush','Avinash','Akash']
Age=[20,30,40]
city=['hyd','blr','chenai']

data=zip(names,Age,city)
cols=['names','Age','city']
df=pd.DataFrame(data,columns=cols)

In [10]:
type(df)

pandas.core.frame.DataFrame

$step-4$

**ADD new column**

- If you want to add new column

- First you need to check the number o rows in already existed data

- For example in above tha dataframe has 3 rows

- You need to create a new list with 3 rows

- that list equate to the dataframe

In [11]:
job=['DS','DE','CS']
df['JOB']=job
df

     names  Age    city JOB
0    Ayush   20     hyd  DS
1  Avinash   30     blr  DE
2    Akash   40  chenai  CS

In [14]:
import pandas as pd
names=['Ayush','Avinash','Akash']
Age=[20,30,40]
city=['hyd','blr','chenai']

data=zip(names,Age,city)
cols=['names','Age','city']
df=pd.DataFrame(data,columns=cols)
df

     names  Age    city
0    Ayush   20     hyd
1  Avinash   30     blr
2    Akash   40  chenai

In [15]:
job=['DS','DE','CS']
df['JOB']=job
df

     names  Age    city JOB
0    Ayush   20     hyd  DS
1  Avinash   30     blr  DE
2    Akash   40  chenai  CS

In [12]:
df['Age']=[35,40,45]
df

     names  Age    city JOB
0    Ayush   35     hyd  DS
1  Avinash   40     blr  DE
2    Akash   45  chenai  CS


$step-5$

**Update the already Existed column**

- Create new column and update new column both are same way

In [16]:
df['Age']=[25,40,45]
df

     names  Age    city JOB
0    Ayush   25     hyd  DS
1  Avinash   40     blr  DE
2    Akash   45  chenai  CS

$step-6$

**Change the Index**

In [18]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
Age=[20,30,40,45]
city=['hyd','blr','chenai','Mumbai']

data=zip(names,Age,city)
cols=['names','Age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)

df

     names  Age    city
A    Ayush   20     hyd
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai

**Note**

- Numner o list equals to NUMBER OF COLUMNS

- Number of values insie list equals to NUMBER OF ROWS

- When you create the data all the lists will be in same length

In [20]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
Age=[20,30,40]
city=['hyd','blr','chenai','Mumbai']

data=zip(names,Age,city)
cols=['names','Age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)

df

ValueError: Length of values (3) does not match length of index (4)

$step-7$

**shape**

  - Number of rows
    
  - Number of colomns

In [21]:
df.shape

# Matrix format
# 4 rows and 3 colomns
print("the number of rows are:",df.shape[0])
print("the number of colmns are:",df.shape[1])

the number of rows are: 4
the number of colmns are: 3

$step-8$

**Drop the column**

- In order to drop column we required 3 arguments

- column name
  
    - The column name we need to mention
    
- axis

  - axis=0 **represents rows**
    
  - axis=1 **represents columns**

- inplace

  - we are drop column means we are modiying the data frame
    
  - so this modifications we want to save in same variable or different variable

  - If you want to keep in the same variable the **inplace=True**

In [22]:
df

     names  Age    city
A    Ayush   20     hyd
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai

In [30]:
df.drop('city',
        axis=1,
        inplace=True)

In [31]:
df

     names  Age
A    Ayush   20
B  Avinash   30
C    Akash   40
D     Anvi   45

In [32]:
df1=df.drop('Age',
        axis=1) # do not give inplce=True

In [34]:
df # has two colums

     names  Age
A    Ayush   20
B  Avinash   30
C    Akash   40
D     Anvi   45

In [35]:
df1=df.drop('Age',axis=1)

In [36]:
df

     names  Age
A    Ayush   20
B  Avinash   30
C    Akash   40
D     Anvi   45

In [37]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
Age=[20,30,40,45]
city=['hyd','blr','chenai','Mumbai']

data=zip(names,Age,city)
cols=['names','Age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)

df

     names  Age    city
A    Ayush   20     hyd
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai

In [38]:
df.drop('city',axis=1,inplace=True)

In [39]:
df

     names  Age
A    Ayush   20
B  Avinash   30
C    Akash   40
D     Anvi   45

In [40]:
df.drop('Age',axis=1)

     names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [41]:
df

     names  Age
A    Ayush   20
B  Avinash   30
C    Akash   40
D     Anvi   45

$step-9$

**Multiple columns drop**

In [44]:
#again read the data
import pandas as pd

names=['Ayush','Avinash','Akash','Anvi']
Age=[20,30,40,45]
city=['hyd','blr','chenai','Mumbai']

data=zip(names,Age,city)
cols=['names','Age','city']
idx=['A','B','C','D']

df=pd.DataFrame(data,
                index=idx,
                columns=cols)

df

     names  Age    city
A    Ayush   20     hyd
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai

In [45]:
df.drop(['Age','city'],axis=1,inplace=True)

In [46]:
df

     names
A    Ayush
B  Avinash
C    Akash
D     Anvi

$step-10$

**Drop the rows**

In [54]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
Age=[20,30,40,45]
city=['hyd','blr','chenai','Mumbai']

data=zip(names,Age,city)
cols=['names','Age','city']
idx=['A','B','C','D']

df=pd.DataFrame(data,
                index=idx,
                columns=cols)

df

     names  Age    city
A    Ayush   20     hyd
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai

In [55]:
df.drop('A',axis=0,inplace=True)

In [56]:
df

     names  Age    city
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai


$step-11$

**How to save the data frame**

- Generally data frames are two types

- Csv (comma seperated value)

- excel

In [57]:
df

     names  Age    city
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai

In [58]:
# file name= data
# extension=.csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [59]:
# Extension
#.xlsx
df.to_excel("data2.xlsx",index=False)

In [62]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
Age=[20,30,40,45]
city=['hyd','blr','chenai','Mumbai']
country=['India','India','India','India']
data=zip(names,Age,city,country)
cols=['names','Age','city','country']
idx=['A','B','C','D']
df_vyshnavi=pd.DataFrame(data,index=idx,columns=cols)
df_vyshnavi

     names  Age    city country
A    Ayush   20     hyd   India
B  Avinash   30     blr   India
C    Akash   40  chenai   India
D     Anvi   45  Mumbai   India

In [63]:
df_vyshnavi.drop('A',axis=0,inplace=True)

In [64]:
df_vyshnavi

     names  Age    city country
B  Avinash   30     blr   India
C    Akash   40  chenai   India
D     Anvi   45  Mumbai   India

In [8]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
Age=[20,30,40,45]
city=['hyd','blr','chenai','Mumbai']

data=zip(names,Age,city)
cols=['names','Age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     names  Age    city
A    Ayush   20     hyd
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai

In [9]:
df.to_csv("data.csv")
df.to_csv("data1.csv",index=False)

In [10]:
df

     names  Age    city
A    Ayush   20     hyd
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai

In [13]:
df.to_excel("data2.xlsx",index=False)

In [14]:
df

     names  Age    city
A    Ayush   20     hyd
B  Avinash   30     blr
C    Akash   40  chenai
D     Anvi   45  Mumbai